Ran Plan for project: `seagl` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production_env.module.dokku-vm.aws_route53_record.dns-a will be updated in-place
~ resource "aws_route53_record" "dns-a" {
        id                               = "Z0173878287JIU5M4KB8R_dokku.host.seagl.org_A"
        name                             = "dokku.host.seagl.org"
      ~ records                          = [
          - "140.211.167.188",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.production_env.module.dokku-vm.openstack_compute_instance_v2.instance must be replaced
-/+ resource "openstack_compute_instance_v2" "instance" {
      ~ access_ip_v4        = "140.211.167.188" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2024-09-02 06:45:59 +0000 UTC" -> (known after apply)
      ~ flavor_id           = "f0847e9b-f7d1-4f6a-a6d3-4eae458dd943" -> (known after apply)
      ~ id                  = "c9cea52c-d27f-4fd6-a676-eee301b9c9d7" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      - key_pair            = "AJ OpenStack bootstrap" -> null # forces replacement
        name                = "dokku"
      ~ region              = "RegionOne" -> (known after apply)
      - tags                = [] -> null
      ~ updated             = "2024-09-02 07:20:04 +0000 UTC" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ block_device {
          - boot_index            = 0 -> null
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "140.211.167.188" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:28:0e:e0" -> (known after apply)
            name           = "general_servers2"
          + port           = (known after apply)
          ~ uuid           = "bcfb335b-cf70-4acf-8cb7-fcf15f890a0f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.production_env.module.mailu-vm.aws_route53_record.dns-a will be updated in-place
~ resource "aws_route53_record" "dns-a" {
        id                               = "Z0173878287JIU5M4KB8R_mailu.host.seagl.org_A"
        name                             = "mailu.host.seagl.org"
      ~ records                          = [
          - "140.211.167.187",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.production_env.module.mailu-vm.openstack_compute_instance_v2.instance must be replaced
-/+ resource "openstack_compute_instance_v2" "instance" {
      ~ access_ip_v4        = "140.211.167.187" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2024-03-13 03:19:56 +0000 UTC" -> (known after apply)
      ~ flavor_id           = "952b0e9a-6ded-46c4-9704-ce6745e9f2c1" -> (known after apply)
      ~ id                  = "c388c80b-fa29-40fe-ae0b-e93803e87b22" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      - key_pair            = "AJ OpenStack bootstrap" -> null # forces replacement
        name                = "mailu"
      ~ region              = "RegionOne" -> (known after apply)
      - tags                = [] -> null
      ~ updated             = "2024-03-13 03:20:06 +0000 UTC" -> (known after apply)
      + user_data           = "ce58ac6040dd5ef465c704b49ba6d6600287333a"
        # (5 unchanged attributes hidden)

      ~ block_device {
          - boot_index            = 0 -> null
          ~ uuid                  = "5e7b09b5-03f1-4f01-bc1b-41db2e1b09d1" -> "9883486d-86b1-493c-9bc8-57f9ef78c8c4"
            # (5 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "140.211.167.187" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:5d:31:25" -> (known after apply)
            name           = "general_servers2"
          + port           = (known after apply)
          ~ uuid           = "bcfb335b-cf70-4acf-8cb7-fcf15f890a0f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.production_env.module.matrix-2024.module.vm.aws_route53_record.dns-a will be updated in-place
~ resource "aws_route53_record" "dns-a" {
        id                               = "Z0173878287JIU5M4KB8R_2024-ephemeral.host.seagl.org_A"
        name                             = "2024-ephemeral.host.seagl.org"
      ~ records                          = [
          - "140.211.167.181",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_compute_instance_v2.instance must be replaced
-/+ resource "openstack_compute_instance_v2" "instance" {
      ~ access_ip_v4        = "140.211.167.181" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2024-10-16 01:57:06 +0000 UTC" -> (known after apply)
      ~ flavor_id           = "952b0e9a-6ded-46c4-9704-ce6745e9f2c1" -> (known after apply)
      ~ id                  = "6f0cbe4a-95e6-4901-8eaa-669471920aec" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      - key_pair            = "AJ OpenStack bootstrap" -> null # forces replacement
        name                = "2024-ephemeral"
      ~ region              = "RegionOne" -> (known after apply)
      - tags                = [] -> null
      ~ updated             = "2024-10-16 02:54:41 +0000 UTC" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ block_device {
          - boot_index            = 0 -> null
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "140.211.167.181" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:58:68:28" -> (known after apply)
            name           = "general_servers2"
          + port           = (known after apply)
          ~ uuid           = "bcfb335b-cf70-4acf-8cb7-fcf15f890a0f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 3 to change, 3 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 30, in provider "openstack":
│   30: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for
│ neutron-lbaas will be removed on next major release. Octavia will be the
│ only supported method for loadbalancer resources. Users using octavia will
│ have to remove 'use_octavia' option from the provider configuration block.
│ Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seagl`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.seagl.org/lock?id=SeaGL%252Fseagl-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seagl`
</details>
Plan: 3 to add, 3 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`